from transformers import VitsModel, AutoTokenizer
import torch

model = VitsModel.from_pretrained("facebook/mms-tts-mar")
tokenizer = AutoTokenizer.from_pretrained("facebook/mms-tts-mar")

text = "नमस्कार मंडळी गुजर रंधकमे तमारू स्वागत हे. आज आपण बAनावसू एकदम जल्दी थनारी कांदानी भाजी. एम तो आपण कांदानी भाजी बे तीन प्रकारे बनाई शकेज पण अपनी आजनी जे भाजी तिनु कॉम्बिनेशन रसनी जोडे खूप भारी लागज. उन्हाळामे रसनी जोडे डाळभात व्हशे लिनी जोडे साईड डिश म्हणून कांदानी भाजी बनाई शकेज. व्हिडिओने सुरुवात करेज. यहा हुवे मेडियम साईजना सात कांदा लयेला हे तिने, फोतरा काढीने येवा पद्धतती कर करी लेसू. आपण ज्यारे कांदो कापज त्यारे पाकळ्या मोकळ्यो थई जाज. कांदाने येवा पद्धतती लंबा लंबा कट करी लेसू. येवा पद्धतती कांदा जर कट कर्यो तो मोकळ्यो थई जाज. ह्या आपणो कांदो तयार पाकळ्यो थई जयोला हे. ह्या हुवे दस बार लसणण्यो पाकळ्यो लयल्यो हे अने कढीपतो लयेलो हे. लसणाने आपण खलबत्तामे बारीक कुटीलेसू. भाजी बघारानी करता कढई तेल लई लिधू. तेल आपणू गरम थयु के तिनामे राई लाखी देसू, राई अपनी मस्त फुल्या के तिनामे जिरू लाखवी देसू, जिरू पण फुल्यू के तिनामे कढीपतो लाखवी देसू, कढी पतो लाख्यो के तिनामे लगेच कांदो लाखवी देसू. केवापण भाजीमे बघार परफेक्ट थयो, तो अपनी भाजी मस्त स्वाद देज. हावडा आपण कांदाहोने मऊ थाइज त्यासुधी चडाई लेसू. कांदा येटला मुकता देखाता हसे पण भाजी अपनी पुरी थाज तेहलेक कांदा गळी  जाज कांदा आपना तयार रह्या तेहलेक, आपना शिंगोणदाना शेकी लेसू. शिंगोणदाणा ठंडा थया के मिक्सरमे जाडा जाडा पिळी लेसू. आपना ये कांदा हे ते मऊ थई जयोला हे."
inputs = tokenizer(text, return_tensors="pt")

with torch.no_grad():
    output = model(**inputs).waveform

output = output.squeeze()

from scipy.io import wavfile

wavfile.write(
    "audio_output.wav",
    model.config.sampling_rate,
    output.cpu().numpy()
)